In [35]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [36]:
df = pd.read_csv('hiring.csv')

In [37]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [38]:
df['experience'].fillna(0, inplace=True)
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(), inplace=True)

In [39]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [40]:
df.shape

(8, 4)

In [41]:
X = df.iloc[:,:3]
X

  experience  test_score(out of 10)  interview_score(out of 10)
0          0               8.000000                           9
1          0               8.000000                           6
2       five               6.000000                           7
3        two              10.000000                          10
4      seven               9.000000                           6
5      three               7.000000                          10
6        ten               7.857143                           7
7     eleven               7.000000                           8

In [42]:
y = df.iloc[:,-1:]
y

   salary($)
0      50000
1      45000
2      60000
3      65000
4      70000
5      62000
6      72000
7      80000

In [43]:
def convert_to_int(word):
    words_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 
                    'seven':7, 'eight':8, 'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0:0}
    return words_dict[word]

In [44]:
X['experience'] = X['experience'].apply(lambda x: convert_to_int(x))

In [45]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()

In [46]:
reg.fit(X,y)

LinearRegression()

In [47]:
pickle.dump(reg, open('model.pkl','wb'))

In [48]:
model = pickle.load(open('model.pkl', 'rb'))
print(model.predict([[4,3,5]]))

[[45271.55714843]]